{
  "articles": [
    {
      "id": 1,
      "title": "Pakistan vs Sri Lanka: Do-or-Die Clash Decides Super 8 Fate in T20 World Cup 2026",
      "snippet": "Pakistan face co-hosts Sri Lanka in a must-win final Super 8 Group 2 match at Pallekele. ICC has outlined the exact NRR margin needed for Pakistan to overtake New Zealand and reach the semi-finals.",
      "image": "https://placehold.co/400x225/10b981/ffffff?text=PAK+vs+SL+T20WC",
      "url": "#",
      "date": "Feb 28, 2026",
      "author": "YoSinTV",
      "labels": ["Cricket", "T20 World Cup", "Super 8"]
    },
    {
      "id": 2,
      "title": "Champions League Last 16 Draw: Real Madrid vs Man City Rematch, PSG Face Chelsea",
      "snippet": "The UEFA Champions League round of 16 draw delivered blockbuster ties: Real Madrid take on Manchester City again, PSG meet Chelsea, Arsenal draw Bayer Leverkusen, and Newcastle face Barcelona.",
      "image": "https://placehold.co/400x225/dc2626/ffffff?text=UCL+Last+16",
      "url": "#",
      "date": "Feb 27, 2026",
      "author": "YoSinTV",
      "labels": ["Football", "Champions League", "Draw"]
    },
    {
      "id": 3,
      "title": "England Qualify for T20 World Cup 2026 Semi-Finals After Thrilling Win Over New Zealand",
      "snippet": "England sealed their semi-final spot with a dramatic victory over New Zealand in Colombo. Harry Brook's form and late hitting from Will Jacks and Rehan Ahmed secured the win.",
      "image": "https://placehold.co/400x225/1d4ed8/ffffff?text=ENG+Qualify",
      "url": "#",
      "date": "Feb 27, 2026",
      "author": "YoSinTV",
      "labels": ["Cricket", "T20 World Cup", "Semi-Finals"]
    },
    {
      "id": 4,
      "title": "Premier League Matchday Live: Arsenal vs Chelsea Headlines Weekend Fixtures",
      "snippet": "A packed Premier League weekend features Arsenal hosting Chelsea in a top-of-the-table clash, Leeds vs Manchester City, and more. Wolves stunned Aston Villa 2-0 in the West Midlands derby yesterday.",
      "image": "https://placehold.co/400x225/1e3a8a/ffffff?text=ARS+vs+CHE",
      "url": "#",
      "date": "Feb 28, 2026",
      "author": "YoSinTV",
      "labels": ["Football", "Premier League", "Match Preview"]
    },
    {
      "id": 5,
      "title": "India Keep Semi-Final Hopes Alive with Dominant Win Over Zimbabwe in T20 World Cup",
      "snippet": "India thrashed Zimbabwe to revive their campaign in Super 8 Group 1. They now face a high-stakes clash with West Indies, with potential India-Pakistan semi-final or final scenarios still possible.",
      "image": "https://placehold.co/400x225/f59e0b/ffffff?text=IND+vs+ZIM",
      "url": "#",
      "date": "Feb 27, 2026",
      "author": "YoSinTV",
      "labels": ["Cricket", "T20 World Cup", "India"]
    },
    {
      "id": 6,
      "title": "Premier League Power Rankings: Chelsea Rise, Liverpool Slip in Latest Update",
      "snippet": "Chelsea climb in the latest Premier League power rankings thanks to strong performances, while Liverpool drop amid inconsistent form. Crystal Palace continue their impressive run.",
      "image": "https://placehold.co/400x225/7c3aed/ffffff?text=PL+Rankings",
      "url": "#",
      "date": "Feb 27, 2026",
      "author": "YoSinTV",
      "labels": ["Football", "Premier League", "Power Rankings"]
    }
  ]
}
